{
  "_name_or_path": "D:\\PythonProject\\PythonProject\\doc1112\\model\\model_5",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-INVOICE_NO",
    "2": "I-INVOICE_NO",
    "3": "B-INVOICE_DATE",
    "4": "I-INVOICE_DATE",
    "5": "B-SELLER",
    "6": "I-SELLER",
    "7": "B-BUYER",
    "8": "I-BUYER",
    "9": "B-DESCRIPTION",
    "10": "I-DESCRIPTION",
    "11": "B-QUANTITY",
    "12": "I-QUANTITY",
    "13": "B-UNIT_PRICE",
    "14": "I-UNIT_PRICE",
    "15": "B-TOTAL_AMOUNT",
    "16": "I-TOTAL_AMOUNT"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-BUYER": 7,
    "B-DESCRIPTION": 9,
    "B-INVOICE_DATE": 3,
    "B-INVOICE_NO": 1,
    "B-QUANTITY": 11,
    "B-SELLER": 5,
    "B-TOTAL_AMOUNT": 15,
    "B-UNIT_PRICE": 13,
    "I-BUYER": 8,
    "I-DESCRIPTION": 10,
    "I-INVOICE_DATE": 4,
    "I-INVOICE_NO": 2,
    "I-QUANTITY": 12,
    "I-SELLER": 6,
    "I-TOTAL_AMOUNT": 16,
    "I-UNIT_PRICE": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
