{
  "add_prefix_space": true,
  "added_tokens_decoder": {
    "0": {
      "content": "<s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<pad>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "3": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "50264": {
      "content": "<mask>",
      "lstrip": true,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "apply_ocr": false,
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": true,
  "cls_token": "<s>",
  "cls_token_box": [
    0,
    0,
    0,
    0
  ],
  "eos_token": "</s>",
  "errors": "replace",
  "mask_token": "<mask>",
  "max_length": 512,
  "model_max_length": 512,
  "only_label_first_subword": true,
  "pad_to_multiple_of": null,
  "pad_token": "<pad>",
  "pad_token_box": [
    0,
    0,
    0,
    0
  ],
  "pad_token_label": -100,
  "pad_token_type_id": 0,
  "padding_side": "right",
  "processor_class": "LayoutLMv3Processor",
  "sep_token": "</s>",
  "sep_token_box": [
    0,
    0,
    0,
    0
  ],
  "stride": 0,
  "tokenizer_class": "LayoutLMv3Tokenizer",
  "trim_offsets": true,
  "truncation_side": "right",
  "truncation_strategy": "longest_first",
  "unk_token": "<unk>"
}
